<?php
	$menu = [
		"О компании" => [
			"О компании",
			"Преподаватели",
			"Программа курсов PHP", 
			"Программа Front-End", 
			"Вопросы и ответы",
			"Блог",
        ],
		"Студентам" => [
			"Личный кабинет",
			"Видеоинструкция",
			"Организационная информация",
			"Расписание занятий",
			"Видеуроки",
			"Домашнее задание",
        ],
        "Видеоуроки",
        "Программа курсов",
        "Партнерам" => [
            "Разработка сайтов" => [
                "интернет-магазин" => [
                  "больше 100 категорий",
                  "меньше 100 категорий" => [
                      '1-50 категорий',
                      '51-100 категорий',
                  ],
                ],
                "landing-page",
                "новостной портал",
            ],
            "Корпоративное обучение",
        ],
        "Курсы Fullstack",
        "Контакты",
];
$i =1; 
function print_menu( $a, $s) {
    foreach ($a as $key => $value) {
    	for ($j=1; $j<$s; $j++)
            {
            	print('<span style="padding-left: 30px;"></span>');
            }
        if (!is_array($value)) {
            print $value . '<br/>';
        } else {
            print $key . '<br/>';
            $s++;
            print_menu($value, $s);
            $s--;
        }

    }
}
print_menu($menu, $i);